// Top 10 Failed Login Attempts
SecurityEvent
| where EventID == 4625
| summarize count() by AccountName
| top 10 by count_

// Detect Brute Force Attacks
SecurityEvent
| where EventID == 4625
| summarize count() by IpAddress, bin(TimeGenerated, 1m)
| where count_ > 10
| render timechart

// Detect Lateral Movement
SecurityEvent
| where EventID == 4624
| summarize count() by IpAddress, AccountName
| where count_ > 1
| render table

// Detect Privilege Escalation
SecurityEvent
| where EventID == 4672
| project TimeGenerated, AccountName, IpAddress, ProcessName

// Detect Suspicious Activity in Azure Active Directory
// Useful for identifying potential account compromise or unauthorized access attempts
SigninLogs
| where ResultType == 50057 // Sign-in failed
| summarize count() by IPAddress, UserPrincipalName, bin(TimeGenerated, 1h)
| where count_ > 10
| render timechart

// Investigate Privileged Role Assignments
// Useful for auditing changes to privileged roles and potential privilege escalation
AuditLogs
| where OperationName has "RBAC"
| extend initiatedBy = tostring(parse_json(InitiatedBy).app.displayName)
| project TimeGenerated, initiatedBy, OperationName, ResultDescription

// Monitor Azure Resource Creation and Deletion
// Useful for detecting potential unauthorized resource provisioning or deprovisioning
AzureActivity
| where OperationName has "Microsoft.Resources/subscriptions/resourceGroups/write" or OperationName has "Microsoft.Resources/subscriptions/resourceGroups/delete"
| project TimeGenerated, OperationName, ResourceGroup, Caller, CallerIpAddress

// Analyze Azure Key Vault Access
// Useful for detecting potential data exfiltration or unauthorized access to secrets and keys
AzureDiagnostics
| where ResourceProvider == "MICROSOFT.KEYVAULT"
| where OperationName == "SecretGet" or OperationName == "KeyGet"
| project TimeGenerated, OperationName, CallerIpAddress, Identity

// Investigate Azure Storage Access
// Useful for detecting potential data exfiltration or unauthorized access to storage accounts
StorageBlobLogs
| where OperationName == "PutBlob" or OperationName == "GetBlob"
| project TimeGenerated, OperationName, ClientIpAddress, UserAgent, Uri

// Monitor Azure Virtual Machine Creation and Deletion
// Useful for detecting potential unauthorized virtual machine provisioning or deprovisioning
AzureActivity
| where OperationName has "Microsoft.Compute/virtualMachines/write" or OperationName has "Microsoft.Compute/virtualMachines/delete"
| project TimeGenerated, OperationName, ResourceGroup, Caller, CallerIpAddress

// Analyze Azure Network Security Group Configuration Changes
// Useful for detecting potential unauthorized changes to network security group rules
AzureActivity
| where OperationName has "Microsoft.Network/networkSecurityGroups/write"
| project TimeGenerated, OperationName, ResourceGroup, Caller, CallerIpAddress


// Query for Activity Log
["Lab1-4-AuditLogs"]
| where ActorUserPrincipalName == "adm1n@bonacu.onmicrosoft.com"

// Query for User Login Failed
["Lab2-1-UAL"]
| extend d = parse_json(AuditData)
| evaluate bag_unpack(d, 'AuditData_')
| summarize count() by Operations, AuditData_ClientIP
| where Operations == "UserLoginFailed"

// Query for Add User Failure
["Lab2-1-UAL"]
| extend d = parse_json(AuditData)
| evaluate bag_unpack(d, 'AuditData_')
| where Operations == "Add user."
| project
| summarize count() by Status = "Failure", IP

// User Accounts
AdeleV@bonacu.onmicrosoft.com
adm1n@bonacu.onmicrosoft.com
Agung.Zerach@bonacu.onmicrosoft.com

// Query for SharePoint Search Queries
["Lab2-2-UAL"]
| where UserIds == "leeg@bonacu.onmicrosoft.com"
| extend d = parse_json(AuditData)
| evaluate bag_unpack(d, 'AuditData_')
| where AuditData_Workload == "SharePoint" and Operations == "SearchQueryPerformed"

// Query for Key Vault Operations
["Lab1-5-AzureDiagnostics"]
| where ResourceProvider == "MICROSOFT.KEYVAULT"
| where OperationName == "SecretGet" or OperationName == "KeyGet"